app/views/comments/_comment_details.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<div class="comment">
        by: <%= link_to cmnt.user.username, user_path(cmnt.user) %> <%= render partial: 'users/status', locals: { group: cmnt.post.group } %>