app/views/groups/index.html.erb

SELECT "groups".* FROM "groups" INNER JOIN "subscriptions" ON "groups"."id" = "subscriptions"."group_id" WHERE "subscriptions"."user_id" = ?  [["user_id", 6]]
SELECT 1 AS one FROM "groups" INNER JOIN "subscriptions" ON "groups"."id" = "subscriptions"."group_id" WHERE "subscriptions"."user_id" = ? LIMIT ?  [["user_id", 6], ["LIMIT", 1]]
---

<% if @user.groups.empty? %>

SELECT "groups".* FROM "groups" INNER JOIN "subscriptions" ON "groups"."id" = "subscriptions"."group_id" WHERE "subscriptions"."user_id" = ?  [["user_id", 2]]
---
<% else %>
    <%= render partial: 'info', collection: @user.groups, as: :group || "You Don't Belong to any Groups!" %>

SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ?  [["user_id", 1]]
---

    <% if @user.subscriptions.invited.empty? %>