app/helpers/follows_helper.rb

    def follow_record(user)
        Follow.find_by(follower_id: current_user.id, followed_user_id: user.id)
---
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = ? AND "follows"."followed_user_id" = ? LIMIT ?  [["follower_id", 1], ["followed_user_id", 2], ["LIMIT", 1]]