app/helpers/groups_helper.rb

SELECT "groups".* FROM "groups" WHERE ("groups"."id" IS NULL OR "groups"."id" = ?) ORDER BY "groups"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def current_group
        Group.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def who_is_mod(group)
        User.find(group.mod_id).username