app/helpers/likes_helper.rb

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]
---
    def already_liked?(post, user)
        return true if Like.find_by(post_id: post.id, user_id: user.id)