app/helpers/subscriptions_helper.rb

    def subscription_exists(user)
        return true if Subscription.find_by(user_id: user.id, group_id: params[:group_id])
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? AND "subscriptions"."group_id" = ? LIMIT ?  [["user_id", 2], ["group_id", 1], ["LIMIT", 1]]

    def no_eligible_members?
        current_user.followers.each do |fllwr|
            return true if Subscription.find_by(user_id: fllwr.id, group_id: params[:group_id]) == nil
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? AND "subscriptions"."group_id" = ? LIMIT ?  [["user_id", 2], ["group_id", 1], ["LIMIT", 1]]

    def current_sub(group, user)
        Subscription.find_by(user_id: user.id, group_id: group.id)
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? AND "subscriptions"."group_id" = ? LIMIT ?  [["user_id", 2], ["group_id", 2], ["LIMIT", 1]]