app/helpers/users_helper.rb

    def all_user_groups(user, invite=false)
        Group.where(id: Subscription.where(user_id: user.id, confirmed: invite).map(&:group_id))
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? AND "subscriptions"."confirmed" = ?  [["user_id", 1], ["confirmed", 1]]

    def unfollowed_users(user)
        User.where(id: Follow.where.not(follower_id: user.id).map(&:followed_user_id))
---
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = ? AND "follows"."followed_user_id" = ? LIMIT ?  [["follower_id", 1], ["followed_user_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?, ?, ?, ?, ?)  [[nil, 3], [nil, 5], [nil, 1], [nil, 1], [nil, 2], [nil, 2]]