app/views/subscriptions/_invite_index.html.erb


    <%= link_to sub.group.name, group_path(sub.group_id) %>
    <br>
    Moderator: <%= link_to sub.group.mod.username, user_path(sub.group.mod) %>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" INNER JOIN "subscriptions" ON "groups"."id" = "subscriptions"."group_id" WHERE "subscriptions"."user_id" = ?  [["user_id", 1]]