app/views/posts/_post_details.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<br>
<%= link_to post.title, group_post_path(post.group_id, post) %> by <%= link_to post.user.display_name, user_path(post.user_id) %>
<div class="button" style="background-color:<%= current_sub(post.group, post.user).status_color %>;">
     <%= current_sub(post.group, post.user).status %>

SELECT "likes".* FROM "likes"
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 5]]
---
<br>
<%= post.likes.count %> <%= link_to "Likes", post_likes_path(post), method: :get %>