app/views/posts/edit.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---

<%= form_for @post, url: group_post_path(@post.group, @post), method: :patch do |f| %>