app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def new
        @comment = Comment.new
        @post = Post.find(params[:post_id])

INSERT INTO "comments" ("post_id", "user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["post_id", 1], ["user_id", 1], ["content", "this is a comment!"], ["created_at", "2021-07-03 07:23:33.698642"], ["updated_at", "2021-07-03 07:23:33.698642"]]
---
    def create
        @comment = Comment.new(comment_params)
        if @comment.valid?
            @comment.save

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def destroy
        if @comment.user == current_user
            @comment.destroy
            redirect_to group_post_path(@comment.post.group_id, @comment.post)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def can_comment?
        return true if Post.find(params[:comment][:post_id]).group.subscribers.include?(current_user)