app/controllers/follows_controller.rb

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def index
        @all_users = User.all
        @user = User.find(params[:user_id])

INSERT INTO "follows" ("follower_id", "followed_user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 1], ["followed_user_id", 2], ["created_at", "2021-06-29 22:48:27.046665"], ["updated_at", "2021-06-29 22:48:27.046665"]]
---
    def create
        @follows = Follow.create(follower_id: current_user.id, followed_user_id: params[:user_id])

SELECT "follows".* FROM "follows" WHERE "follows"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 1]]
---
    def destroy
        @follow = Follow.find(params[:id])
        if current_user.id == @follow.follower_id
            @follow.destroy