app/controllers/groups_controller.rb

INSERT INTO "groups" ("name", "bio", "mod_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test group"], ["bio", "imagroupbio"], ["mod_id", 12], ["created_at", "2021-07-04 05:26:29.482539"], ["updated_at", "2021-07-04 05:26:29.482539"]]
INSERT INTO "groups" ("name", "bio", "mod_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "papas"], ["bio", "test bio"], ["mod_id", 6], ["created_at", "2021-07-15 21:54:20.042516"], ["updated_at", "2021-07-15 21:54:20.042516"]]
---
    def create
        @group = Group.create(group_params)
        if @group.valid?
            @group.save

UPDATE "groups" SET "name" = ?, "bio" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["name", "New Group Name"], ["bio", "Frick this bio"], ["updated_at", "2021-07-03 21:18:31.974689"], ["id", 5]]
---
    def update
        if @group.update(group_params)

DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 7]]
---
    def destroy
        if @group.mod == current_user
            @group.destroy