app/controllers/likes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def index
        @post = Post.find(params[:post_id])

INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["user_id", 1], ["created_at", "2021-07-03 06:05:43.980859"], ["updated_at", "2021-07-03 06:05:43.980859"]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def create
        @like = Like.new(user_id: current_user.id, post_id: params[:post_id])
        if @like.save
            redirect_to group_post_path(@like.post.group, @like.post)

SELECT "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 13]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def destroy
        @like = Like.find(params[:id])
        if @like.user_id == current_user.id
            @like.destroy
            redirect_to group_post_path(@like.post.group, @like.post)