app/controllers/posts_controller.rb

INSERT INTO "posts" ("group_id", "user_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["group_id", 1], ["user_id", 1], ["title", "new title"], ["content", "wujgfe"], ["created_at", "2021-07-04 10:41:31.140104"], ["updated_at", "2021-07-04 10:41:31.140104"]]
---
  def create
    @post = Post.new(post_params)
    if @post.valid?
      @post.save

UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "EDITED: dont like this title"], ["content", "EDITED: old\r\n"], ["updated_at", "2021-07-04 05:29:53.635613"], ["id", 6]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "EDITED yes me"], ["content", "EDITED fasdfdasfdf"], ["updated_at", "2021-07-04 11:46:31.231418"], ["id", 7]]
---
  def update
    if post_params
      @post.update(title: "EDITED #{params[:post][:title]}", content: "EDITED #{params[:post][:content]}")
      @post.save

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 5]]
---
  def destroy
    if @post.user == current_user
      @post.destroy

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def check_user_params
    if Group.find(params[:group_id]).valid_poster?(current_user)