app/controllers/subscriptions_controller.rb

    def create
        @new_sub = Subscription.new(subscription_params)
        if @new_sub.save
---
INSERT INTO "subscriptions" ("user_id", "group_id", "moderator", "confirmed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["group_id", 1], ["moderator", 0], ["confirmed", 0], ["created_at", "2021-07-01 20:00:14.763067"], ["updated_at", "2021-07-01 20:00:14.763067"]]

    def update
        @sub = Subscription.find_by(user_id: current_user.id, group_id: params[:group_id])
        @sub.update(confirmed: true)
        redirect_to group_path(@sub.group_id)
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? AND "subscriptions"."group_id" = ? LIMIT ?  [["user_id", 2], ["group_id", 1], ["LIMIT", 1]]
UPDATE "subscriptions" SET "confirmed" = ?, "updated_at" = ? WHERE "subscriptions"."id" = ?  [["confirmed", 1], ["updated_at", "2021-07-01 20:38:43.188333"], ["id", 2]]
SELECT "groups".* FROM "groups"

    def destroy
        @sub = Subscription.find(params[:id])
        if @sub.user_id == current_user.id
            @sub.destroy
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "subscriptions" WHERE "subscriptions"."id" = ?  [["id", 2]]

    def last_subscription
        if Group.find(params[:group_id]).subscribers.empty?
            Group.find(params[:group_id]).destroy
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 3]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]