app/controllers/subscriptions_controller.rb

SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? AND "subscriptions"."group_id" = ? LIMIT ?  [["user_id", 12], ["group_id", 6], ["LIMIT", 1]]
---
    def set_sub
        @sub = Subscription.find_by(user_id: current_user.id, group_id: params[:group_id])