app/controllers/users_controller.rb

    def update
        @user = User.find(params[:id])
        if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "bio" = ? WHERE "users"."id" = ?  [["updated_at", "2021-06-30 05:08:05.179429"], ["bio", "new bio"], ["id", 1]]