app/models/follow.rb

    def not_already_followed?
        return false if Follow.find_by(follower_id: self.follower_id, followed_user_id: self.followed_user_id)
---
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = ? AND "follows"."followed_user_id" = ? LIMIT ?  [["follower_id", 1], ["followed_user_id", 2], ["LIMIT", 1]]