app/models/group.rb

INSERT INTO "subscriptions" ("user_id", "group_id", "moderator", "confirmed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 6], ["group_id", 9], ["moderator", 1], ["confirmed", 1], ["created_at", "2021-07-15 21:54:20.054368"], ["updated_at", "2021-07-15 21:54:20.054368"]]
---
    def create_first_subscriber
        Subscription.create(user_id: mod_id, group_id: self.id, moderator: true, confirmed: true)