app/models/group.rb

INSERT INTO "subscriptions" ("user_id", "group_id", "moderator", "confirmed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 12], ["group_id", 6], ["moderator", 1], ["confirmed", 1], ["created_at", "2021-07-04 05:26:29.495808"], ["updated_at", "2021-07-04 05:26:29.495808"]]
---
    def create_first_subscriber
        Subscription.create(user_id: mod_id, group_id: self.id, moderator: true, confirmed: true)

SELECT "posts".* FROM "posts" WHERE "posts"."group_id" = ?  [["group_id", 4]]
DELETE FROM "subscriptions" WHERE "subscriptions"."id" = ?  [["id", 14]]
---
    def clear_house
        self.posts.each do |post|
            post.comments.destroy_all
            post.likes.destroy_all
        end
        self.subscriptions.destroy_all