app/models/like.rb

    def not_already_liked?
        if Like.exists?(user_id: self.user_id, post_id: self.post_id)
---
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 1], ["LIMIT", 1]]