app/models/post.rb

    def cleared_to_post
        if !Group.find(self.group_id).subscribers.include?(User.find(self.user_id))
---
SELECT "posts".* FROM "posts" WHERE "posts"."group_id" = ? ORDER BY comments_count DESC  [["group_id", 6]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]