app/models/subscription.rb

SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."group_id" = ? AND "subscriptions"."user_id" = ? LIMIT ?  [["group_id", 5], ["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "subscriptions" WHERE "subscriptions"."user_id" = ? AND "subscriptions"."group_id" = ? LIMIT ?  [["user_id", 1], ["group_id", 1], ["LIMIT", 1]]
---
    def doesnt_already_exist
        if Subscription.exists?(user_id: self.user_id, group_id: self.group_id)